Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40000328" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO74" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000032C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO75" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000330" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO76" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000334" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO77" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000338" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO78" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000033C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO79" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000340" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO80" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000344" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO81" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000348" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO82" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000034C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO83" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000350" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO84" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000354" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO85" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000358" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO86" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000035C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO87" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
