Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40020054" edc:access="------------wwww------------wwww" edc:cname="PWM0_OSSUPD" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:desc="Output Selection Set for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:desc="Output Selection Set for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:desc="Output Selection Set for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH3" edc:desc="Output Selection Set for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:desc="Output Selection Set for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:desc="Output Selection Set for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:desc="Output Selection Set for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL3" edc:desc="Output Selection Set for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020058" edc:access="------------wwww------------wwww" edc:cname="PWM0_OSCUPD" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:desc="Output Selection Clear for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:desc="Output Selection Clear for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:desc="Output Selection Clear for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH3" edc:desc="Output Selection Clear for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:desc="Output Selection Clear for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:desc="Output Selection Clear for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:desc="Output Selection Clear for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL3" edc:desc="Output Selection Clear for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002005C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM0_FMR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPOL" edc:desc="Fault Polarity" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:desc="Fault Activation Mode" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:desc="Fault Filtering" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020060" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PWM0_FSR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FIV" edc:desc="Fault Input Value" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FS" edc:desc="Fault Status" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020064" edc:access="------------------------wwwwwwww" edc:cname="PWM0_FCR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FCLR" edc:desc="Fault Clear" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020068" edc:access="------------nnnn------------nnnn" edc:cname="PWM0_FPV1" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPVH0" edc:desc="Fault Protection Value for PWMH output on channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVH1" edc:desc="Fault Protection Value for PWMH output on channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVH2" edc:desc="Fault Protection Value for PWMH output on channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVH3" edc:desc="Fault Protection Value for PWMH output on channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPVL0" edc:desc="Fault Protection Value for PWML output on channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVL1" edc:desc="Fault Protection Value for PWML output on channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVL2" edc:desc="Fault Protection Value for PWML output on channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVL3" edc:desc="Fault Protection Value for PWML output on channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002006C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM0_FPE" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPE0" edc:desc="Fault Protection Enable for channel 0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FPE1" edc:desc="Fault Protection Enable for channel 1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FPE2" edc:desc="Fault Protection Enable for channel 2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FPE3" edc:desc="Fault Protection Enable for channel 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
