Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40020158" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP2PWM0_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002015C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP2PWM0_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020160" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP3PWM0_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020164" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP3PWM0_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020168" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP3PWM0_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002016C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP3PWM0_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020170" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP4PWM0_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020174" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP4PWM0_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020178" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP4PWM0_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002017C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP4PWM0_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020180" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP5PWM0_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020184" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP5PWM0_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020188" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP5PWM0_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002018C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP5PWM0_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
