Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40028010" edc:access="rrrrrrrr----rrrrrrr--rrrrrr--rrr" edc:cname="US_IMR" edc:impl="0xFF0FE7E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:desc="LON Short Frame Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:desc="LON CRC Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Timeout Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="SPI Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:desc="LIN Break Sent or LIN Break Received Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:desc="LIN Transfer Completed Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:desc="LON Transmission Done Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:desc="LON Collision Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:desc="LON Frame Early Termination Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:desc="LON Reception Done Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:desc="LON Backlog Overflow Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:desc="LIN Slave Not Responding Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:desc="LIN Synch Tolerance Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:desc="LIN Header Timeout Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40028014" edc:access="rrrrrrrrrrrrrrrrrrr--rrrrrr--rrr" edc:cname="US_CSR" edc:impl="0xFFFFE7E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready (cleared by reading US_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:desc="LON Short Frame Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:desc="LON CRC Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:desc="LIN Break Sent or LIN Break Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:desc="LIN Identifier Sent or LIN Identifier Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:desc="LIN Transfer Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RI" edc:desc="Image of RI Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSR" edc:desc="Image of DSR Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCD" edc:desc="Image of DCD Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINBLS" edc:desc="LIN Bus Line Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:desc="LON Transmission End Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:desc="LON Collision Detected Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:desc="LON Frame Early Termination" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:desc="LON Reception End Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:desc="LON Backlog Overflow Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:desc="LIN Slave Not Responding Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:desc="LIN Synch Tolerance Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:desc="LIN Header Timeout Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40028018" edc:access="----------------r------rrrrrrrrr" edc:cname="US_RHR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:desc="Received Sync" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002801C" edc:access="----------------w------wwwwwwwww" edc:cname="US_THR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:desc="Sync Field to be Transmitted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
