Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:AdjustPoint edc:_addr="0x400280EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x4002C000" edc:access="----------wwwwwwwwwwwwwwwwwwww--" edc:cname="US_CR" edc:impl="0x3FFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:desc="Reset Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:desc="Reset Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:desc="Reset Status Bits" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTBRK" edc:desc="Start Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STPBRK" edc:desc="Stop Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTTO" edc:desc="Clear TIMEOUT Flag and Start Timeout After Next Character Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SENDA" edc:desc="Send Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIT" edc:desc="Reset Iterations" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTNACK" edc:desc="Reset Non Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RETTO" edc:desc="Start Timeout Immediately" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTREN" edc:desc="Data Terminal Ready Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTRDIS" edc:desc="Data Terminal Ready Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCS" edc:desc="Force SPI Chip Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCS" edc:desc="Release SPI Chip Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINABT" edc:desc="Abort LIN Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINWKUP" edc:desc="Send LIN Wakeup Signal" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C004" edc:access="nnnn-nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_MR" edc:impl="0xF7FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="USART_MODE" edc:desc="USART Mode of Operation" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RS485" edc:desc="RS485" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HW_HANDSHAKING" edc:desc="Hardware handshaking" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODEM" edc:desc="Modem" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_0" edc:desc="IS07816 Protocol: T = 0" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_1" edc:desc="IS07816 Protocol: T = 1" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="IRDA" edc:desc="IrDA" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="LON" edc:desc="LON" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="LIN_MASTER" edc:desc="LIN Master mode" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="LIN_SLAVE" edc:desc="LIN Slave mode" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI Slave mode" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USCLKS" edc:desc="Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Peripheral clock divided (DIV = 8) is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PCK" edc:desc="PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Serial clock (SCK) is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHRL" edc:desc="Character Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_5_BIT" edc:desc="Character length is 5 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_6_BIT" edc:desc="Character length is 6 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_7_BIT" edc:desc="Character length is 7 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="Character length is 8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="SPI Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:desc="Parity Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Parity forced to 0 (Space)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Parity forced to 1 (Mark)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MULTIDROP" edc:desc="Multidrop mode" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSTOP" edc:desc="Number of Stop Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BIT" edc:desc="1 stop bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_5_BIT" edc:desc="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BIT" edc:desc="2 stop bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:desc="Channel Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic Echo. Receiver input is connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local Loopback. Transmitter output is connected to the Receiver Input." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote Loopback. RXD pin is internally connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="SPI Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE9" edc:desc="9-bit Character Length" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKO" edc:desc="Clock Output Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVER" edc:desc="Oversampling Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRDBT" edc:desc="Wait Read Data Before Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSNACK" edc:desc="Disable Successive NACK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAR_SYNC" edc:desc="Variable Synchronization of Command/Data Sync Start Frame Delimiter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVDATA" edc:desc="Inverted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAX_ITERATION" edc:desc="Maximum Number of Automatic Iteration" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Receive Line Filter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAN" edc:desc="Manchester Encoder/Decoder Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODSYNC" edc:desc="Manchester Synchronization Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONEBIT" edc:desc="Start Frame Delimiter Selector" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C008" edc:access="wwwwwwww----wwwwwww--wwwwww--www" edc:cname="US_IER" edc:impl="0xFF0FE7E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:desc="LON Short Frame Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:desc="LON CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Timeout Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:desc="LIN Break Sent or LIN Break Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:desc="LIN Transfer Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:desc="LON Transmission Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:desc="LON Collision Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:desc="LON Frame Early Termination Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:desc="LON Reception Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:desc="LON Backlog Overflow Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:desc="LIN Slave Not Responding Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:desc="LIN Synch Tolerance Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:desc="LIN Header Timeout Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C00C" edc:access="wwwwwwww----wwwwwww--wwwwww--www" edc:cname="US_IDR" edc:impl="0xFF0FE7E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:desc="LON Short Frame Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:desc="LON CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Timeout Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="SPI Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:desc="LIN Break Sent or LIN Break Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:desc="LIN Transfer Completed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:desc="LON Transmission Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:desc="LON Collision Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:desc="LON Frame Early Termination Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:desc="LON Reception Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:desc="LON Backlog Overflow Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:desc="LIN Slave Not Responding Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:desc="LIN Synch Tolerance Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:desc="LIN Header Timeout Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C010" edc:access="rrrrrrrr----rrrrrrr--rrrrrr--rrr" edc:cname="US_IMR" edc:impl="0xFF0FE7E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:desc="LON Short Frame Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:desc="LON CRC Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Timeout Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="SPI Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:desc="LIN Break Sent or LIN Break Received Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:desc="LIN Transfer Completed Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:desc="LON Transmission Done Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:desc="LON Collision Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:desc="LON Frame Early Termination Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:desc="LON Reception Done Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:desc="LON Backlog Overflow Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:desc="LIN Slave Not Responding Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:desc="LIN Synch Tolerance Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:desc="LIN Header Timeout Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C014" edc:access="rrrrrrrrrrrrrrrrrrr--rrrrrr--rrr" edc:cname="US_CSR" edc:impl="0xFFFFE7E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready (cleared by reading US_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:desc="LON Short Frame Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:desc="LON CRC Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:desc="LIN Break Sent or LIN Break Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:desc="LIN Identifier Sent or LIN Identifier Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:desc="LIN Transfer Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RI" edc:desc="Image of RI Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSR" edc:desc="Image of DSR Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCD" edc:desc="Image of DCD Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINBLS" edc:desc="LIN Bus Line Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:desc="LON Transmission End Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:desc="LON Collision Detected Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:desc="LON Frame Early Termination" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:desc="LON Reception End Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:desc="LON Backlog Overflow Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:desc="LIN Slave Not Responding Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:desc="LIN Synch Tolerance Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:desc="LIN Header Timeout Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C018" edc:access="----------------r------rrrrrrrrr" edc:cname="US_RHR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:desc="Received Sync" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
