Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40038420" edc:access="--------nnnnnnnn--nnnnnnnnnnnnnn" edc:cname="USBHS_HSTFNUM" edc:impl="0xFF3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:desc="Micro Frame Number" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:desc="Frame Number" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLENHIGH" edc:desc="Frame Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038424" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="USBHS_HSTADDR1" edc:impl="0x7F7F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="HSTADDRP0" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP1" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP2" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP3" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038428" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="USBHS_HSTADDR2" edc:impl="0x7F7F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="HSTADDRP4" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP5" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP6" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP7" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003842C" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="USBHS_HSTADDR3" edc:impl="0x7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="HSTADDRP8" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP9" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038430" edc:offset="0xD0"/>
      <edc:SFRDef edc:_addr="0x40038500" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:cname="USBHS_HSTPIPCFG0" edc:impl="0xFF1F377E" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:desc="Pipe Memory Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:desc="Pipe Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:desc="Pipe Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:desc="Pipe Token" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:desc="Automatic Switch" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:desc="Pipe Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:desc="Pipe Endpoint Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:desc="Ping Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
