Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40038604" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER5" edc:impl="0x710FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038608" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER6" edc:impl="0x710FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003860C" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER7" edc:impl="0x710FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038610" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER8" edc:impl="0x710FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038614" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER9" edc:impl="0x710FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038618" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038620" edc:access="--------------ww-w-w----wwwwwwww" edc:cname="USBHS_HSTPIPIDR0" edc:impl="0x350FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:desc="Received IN Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:desc="Transmitted OUT Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:desc="Underflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:desc="Pipe Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:desc="NAKed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:desc="Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:desc="CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:desc="Short Packet Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:desc="Pipe Interrupts Disable HDMA Request Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:desc="Pipe Freeze Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038624" edc:access="--------------ww-w-w----wwwwwwww" edc:cname="USBHS_HSTPIPIDR1" edc:impl="0x350FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:desc="Received IN Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:desc="Transmitted OUT Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:desc="Underflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:desc="Pipe Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:desc="NAKed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:desc="Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:desc="CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:desc="Short Packet Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:desc="Pipe Interrupts Disable HDMA Request Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:desc="Pipe Freeze Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
