Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x40050028" edc:access="--wwwwwwwwwwww--wwwwww--wwwwwwww" edc:cname="GMAC_IER" edc:impl="0x3FFCFCFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:desc="Enable RX LPI Indication" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUTIMCOMP" edc:desc="TSU Timer Comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005002C" edc:access="--wwwwwwwwwwww--wwwwww--wwwwwwww" edc:cname="GMAC_IDR" edc:impl="0x3FFCFCFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:desc="Enable RX LPI Indication" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUTIMCOMP" edc:desc="TSU Timer Comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050030" edc:access="--nnnnnnnnnnnn--nnnnnn--nnnnnnnn" edc:cname="GMAC_IMR" edc:impl="0x3FFCFCFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:desc="Enable RX LPI Indication" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUTIMCOMP" edc:desc="TSU Timer Comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_MAN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="PHY Data" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="WTN" edc:desc="Write Ten" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="REGA" edc:desc="Register Address" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PHYA" edc:desc="PHY Address" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="OP" edc:desc="Operation" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CLTTO" edc:desc="Clause 22 Operation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WZO" edc:desc="Write ZERO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050038" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_RPQ" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RPQ" edc:desc="Received Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005003C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TPQ" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TPQ" edc:desc="Transmit Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
