Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x4005079C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW19GMAC_ST2CW1" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507A0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW20GMAC_ST2CW0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507A4" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW20GMAC_ST2CW1" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW21GMAC_ST2CW0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507AC" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW21GMAC_ST2CW1" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507B0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW22GMAC_ST2CW0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507B4" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW22GMAC_ST2CW1" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507B8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW23GMAC_ST2CW0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507BC" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW23GMAC_ST2CW1" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400507C0" edc:offset="0x3840"/>
      <edc:SFRDef edc:_addr="0x40054000" edc:access="-----------------------------www" edc:cname="TC_CHANNEL0TC3_CCR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="Counter Clock Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKDIS" edc:desc="Counter Clock Disable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRG" edc:desc="Software Trigger Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
