Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71N19B.PIC
      <edc:SFRDef edc:_addr="0x400782C0" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID9XDMAC_CSUS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:desc="Channel x Source Microblock Stride" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400782C4" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID9XDMAC_CDUS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:desc="Channel x Destination Microblock Stride" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400782C8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400782D0" edc:access="-------------------------wwwwwww" edc:cname="XDMAC_CHID10XDMAC_CIE" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:desc="End of Block Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:desc="End of Linked List Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:desc="End of Disable Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:desc="End of Flush Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:desc="Read Bus Error Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:desc="Write Bus Error Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:desc="Request Overflow Error Interrupt Enable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400782D4" edc:access="-------------------------wwwwwww" edc:cname="XDMAC_CHID10XDMAC_CID" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BID" edc:desc="End of Block Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LID" edc:desc="End of Linked List Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DID" edc:desc="End of Disable Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FID" edc:desc="End of Flush Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBEID" edc:desc="Read Bus Error Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WBEID" edc:desc="Write Bus Error Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ROID" edc:desc="Request Overflow Error Interrupt Disable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400782D8" edc:access="-------------------------rrrrrrr" edc:cname="XDMAC_CHID10XDMAC_CIM" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIM" edc:desc="End of Block Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LIM" edc:desc="End of Linked List Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIM" edc:desc="End of Disable Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIM" edc:desc="End of Flush Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBEIM" edc:desc="Read Bus Error Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WBEIM" edc:desc="Write Bus Error Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ROIM" edc:desc="Request Overflow Error Interrupt Mask Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400782DC" edc:access="-------------------------rrrrrrr" edc:cname="XDMAC_CHID10XDMAC_CIS" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIS" edc:desc="End of Block Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LIS" edc:desc="End of Linked List Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:desc="End of Disable Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIS" edc:desc="End of Flush Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBEIS" edc:desc="Read Bus Error Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WBEIS" edc:desc="Write Bus Error Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ROIS" edc:desc="Request Overflow Error Interrupt Status Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400782E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID10XDMAC_CSA" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SA" edc:desc="Channel x Source Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400782E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID10XDMAC_CDA" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DA" edc:desc="Channel x Destination Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
